brew "git"
brew "tmux"
brew "vim"
brew "gnupg"
brew "pinentry-mac"
brew "stow"
brew "hub"
brew "kubectl"
brew "direnv"
brew "neovim"
brew "autojump"
brew "ssh-copy-id"
brew "tree"
brew "pv"
brew "httpie"
brew "coreutils"
brew "tig"
brew "jq"
brew "watch"
brew "htop"
brew "wget"
brew "psgrep"
brew "exa"
brew "sops"
brew "fzf"
brew "peco"
brew "terminal-notifier"
brew "starship"
brew "shellcheck"
brew "mdbook"
brew "jrnl"
brew "helm"
brew "ghq"
brew "diff-so-fancy"
brew "awscli"
brew "yq"
brew "kubectx"

cask "java" unless system "/usr/libexec/java_home --failfast"
cask "meld"

tap "johanhaleby/kubetail"
brew "kubetail"

# For Massdrop/Drop CTRL Keyboard QMK Firmware
# https://docs.qmk.fm/#/getting_started_build_tools?id=macos
tap "osx-cross/avr"
tap "PX4/homebrew-px4"
brew "avr-gcc@8", link: true
brew "dfu-programmer"
brew "dfu-util"
brew "gcc-arm-none-eabi"
brew "avrdude"
