tap "homebrew/bundle"
tap "homebrew/core"
tap "caskroom/cask"

brew "git"
brew "tmux"
brew "vim"
brew "gpg"
brew "pinentry-mac"
brew "git-secret"
brew "stow"
brew "antigen"
brew "hub"
brew "kubectl"
brew "direnv"
brew "neovim"
brew "autojump"
brew "leiningen"
brew "ssh-copy-id"
brew "tree"
brew "npm"
brew "pv"
brew "sshuttle"
brew "httpie"
brew "coreutils"
brew "tig"
brew "jq"
brew "emacs"
brew "go"
brew "watch"
brew "zsh"
brew "htop"
brew "wget"
brew "psgrep"
brew "exa"
brew "watch"
brew "sops"
brew "fzf"
brew "terminal-notifier"
brew "highlight"

cask "java" unless system "/usr/libexec/java_home --failfast"
cask "visual-studio-code"
cask "meld"
cask "minikube"
